app/Models/Brand.php

        public function selectBrandbyStatus($status = 'E')
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->allowedFields[3].'<>' => $status]);
            $data = $query->get()->getResult();
---
SELECT *
FROM `brand`
WHERE `Status` <> 'E'

        public function selectBrandbyID($brandID, $status = 'E')
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->primaryKey[0] => $brandID]);
            $query = $blueprint->where([$this->allowedFields[3].'<>' => $status]);
            $data = $query->get()->getResult();
---
SELECT *
FROM `brand`
WHERE `BrandID` = '6'
AND `Status` <> 'E'

        public function selectBrandbyOwnerID($ownerID, $status = 'E')
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->foreignKeys[0] => $ownerID]);
---
SELECT *
FROM `brand`
WHERE `OwnerID` = '4'