app/Models/Brand_Access.php

        public function selectBrand_AccessbyCorpID($corparationID, $limit = 99, $status = 'E')
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->foreignKeys[1] => $corparationID]);
            $query = $blueprint->where([$this->allowedFields[1].'<>' => $status]);
            $query = $blueprint->limit($limit);
            $data = $query->get()->getResult();
---
SELECT *
FROM `brand_access`
WHERE `CorparationID` = '4'
AND `Status` <> 'E'
 LIMIT 99

        public function selectBrand_AccessbyIDandStatus($brand_accessID, $status = 'E')
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->primaryKey[0] => $brand_accessID]);
            $query = $blueprint->where([$this->allowedFields[1].'<>' => $status]);
            $data = $query->get()->getResult();
---
SELECT *
FROM `brand_access`
WHERE `Brand_AccessID` = '4'
AND `Status` <> 'E'

        public function selectBrand_AccessbyBrandIDandRelationship($brandID, $relationship, $status = 'E')
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->foreignKeys[0] => $brandID]);
            $query = $blueprint->where([$this->allowedFields[0] => $relationship]);
            $query = $blueprint->where([$this->allowedFields[1].'<>' => $status]);
---
SELECT *
FROM `brand_access`
WHERE `BrandID` = '6'
AND `Relationship` = 'Rejected by User'
AND `Status` <> 'E'

        public function updateStatusofBrand_AccessbyID($brand_accessID, $status = 'E')
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->primaryKey[0] => $brand_accessID]);

            $data = $query->get()->getResult();
            $query = $blueprint->where([$this->primaryKey[0] => $brand_accessID]);
            $query = $blueprint->update([$this->allowedFields[1] => $status]);
---
SELECT *
FROM `brand_access`
WHERE `Brand_AccessID` = '34'
UPDATE `brand_access` SET `Status` = 'E'
WHERE `Brand_AccessID` = '34'