app/Models/Corparation.php

SELECT *
FROM `corparation`
WHERE `Status` <> 'E'
 LIMIT 5
---
        public function selectCompany($limit = 99, $status = 'E')
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->allowedFields[6].'<>' => $status]);
            $query = $blueprint->limit($limit);
            $data = $query->get()->getResult();

SELECT *
FROM `corparation`
WHERE `CorparationID` = '5'
AND `Status` <> 'E'
---
        public function selectCompanybyID($corparationID, $status = 'E')
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->primaryKey[0] => $corparationID]);
            $query = $blueprint->where([$this->allowedFields[6].'<>' => $status]);
            $data = $query->get()->getResult();