app/Models/Equipment.php

SELECT *
FROM `equipment`
WHERE `Brand_AccessID` = '15'
AND `Status` = 'A'
 LIMIT 99
---
        public function selectEquipmentsbyBrnadID($brand_accessID, $limit = 99, $status = 'A')
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->foreignKeys[1] => $brand_accessID]);
            $query = $blueprint->where([$this->allowedFields[3] => $status]);
            $query = $blueprint->limit($limit);
            $data = $query->get()->getResult();

SELECT *
FROM `equipment`
WHERE `CorparationID` = '4'
AND `Status` = 'A'
 LIMIT 99
---
        public function selectEquipmentsbyCorparationID($corparationID, $limit = 99, $status = 'A')
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->foreignKeys[0] => $corparationID]);
            $query = $blueprint->where([$this->allowedFields[3] => $status]);
            $query = $blueprint->limit($limit);
            $data = $query->get()->getResult();