app/Models/Genre.php

SELECT *
FROM `genre`
WHERE `GenreID` = '7'
---
        public function selectGenrebyParentID($ParentID, $limit)
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->foreignKeys[0] => $ParentID]);
            $query = $blueprint->limit($limit);
            $data = $query->get()->getResult();