app/Models/Item.php

SELECT *
FROM `item`
WHERE `EquipmentID` = '6'
AND `Status` = 'A'
 LIMIT 5
---
        public function selectItembyEquipmentID($EquipmentID, $limit = 99, $status = 'A')
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->foreignKeys[0] => $EquipmentID]);
            $query = $blueprint->where([$this->allowedFields[1] => $status]);
            $query = $blueprint->limit($limit);
            $data = $query->get()->getResult();