app/Models/Supplier.php

        public function selectgetSupplierDataviaUserID($UserID, $Status = 'A')
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->foreignKeys[0] => $UserID]);
            $query = $blueprint->where([$this->allowedFields[3] => $Status]);
            // $query = $blueprint->join('brand',$this->table.'.'.$this->allowedFields[0].' = brand.BrandID');
            $data = $query->get()->getResult();
---
SELECT *
FROM `supplier`
WHERE `UserID` = '1'
AND `Status` = 'A'