app/Models/User.php

        public function selectUserbyUsername($username)
        {
            $blueprint = $this->db->table($this->table);
            $query = $blueprint->where([$this->allowedFields[0] => $username]);
            $data = $query->get()->getResult();
---
SELECT *
FROM `user`
WHERE `UserName` = 'Visula'